In [3]:
import pandas as pd
import numpy as np
from sklearn.model_selection import train_test_split
from sklearn.metrics import mutual_info_score

In [4]:
data = pd.read_csv("course_lead_scoring.csv")
data.head()

,lead_source,industry,number_of_courses_viewed,annual_income,employment_status,location,interaction_count,lead_score,converted
0,paid_ads,NaN,1,79450.0,unemployed,south_america,4,0.94,1
1,social_media,retail,1,46992.0,employed,south_america,1,0.80,0
2,events,healthcare,5,78796.0,unemployed,australia,3,0.69,1
3,paid_ads,retail,2,83843.0,NaN,australia,1,0.87,0
4,referral,education,3,85012.0,self_employed,europe,3,0.62,1

In [5]:
data.isna().sum()

lead_source                 128
industry                    134
number_of_courses_viewed      0
annual_income               181
employment_status           100
location                     63
interaction_count             0
lead_score                    0
converted                     0
dtype: int64

In [6]:
cols = data.columns
categorical = ['lead_source', 'industry',
       'employment_status', 'location']
numerical = ['number_of_courses_viewed', 'annual_income',
       'interaction_count', 'lead_score']

In [7]:
data[categorical] = data[categorical].fillna("NA")
data[numerical] = data[numerical].fillna(0.0)
data.isna().sum()

lead_source                 0
industry                    0
number_of_courses_viewed    0
annual_income               0
employment_status           0
location                    0
interaction_count           0
lead_score                  0
converted                   0
dtype: int64

In [8]:
data['industry'].value_counts()

industry
retail           203
finance          200
other            198
healthcare       187
education        187
technology       179
manufacturing    174
NA               134
Name: count, dtype: int64

In [9]:
data[numerical].corr().abs()

,number_of_courses_viewed,annual_income,interaction_count,lead_score
number_of_courses_viewed,1.000000,0.009770,0.023565,0.004879
annual_income,0.009770,1.000000,0.027036,0.015610
interaction_count,0.023565,0.027036,1.000000,0.009888
lead_score,0.004879,0.015610,0.009888,1.000000

In [10]:
X_train_full, X_test, y_train_full, y_test = train_test_split(data, data['converted'], test_size = 0.2, random_state = 42) 
X_train, X_valid, y_train, y_valid = train_test_split(X_train_full, y_train_full, test_size=0.25, random_state=42)

del X_train['converted']
del X_valid['converted']
del X_test['converted']

In [11]:
mi_scores = round(X_train[categorical].apply(lambda col: mutual_info_score(col, y_train)), 2)
mi_scores
# mutual_info_score(X_train['industry'], y_train)

lead_source          0.04
industry             0.01
employment_status    0.01
location             0.00
dtype: float64